zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/qspi.h
/**
 * \brief Component description for PIC32CZ/CA70 QSPI
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_QSPI_COMPONENT_H_
#define _PIC32CZ_CA70_QSPI_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_QSPI Quad Serial Peripheral Interface
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR QSPI */
/* ========================================================================== */

/* -------- QSPI_CR : (QSPI Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t QSPIEN:1;                  /**< bit:      0  QSPI Enable                                   */
    uint32_t QSPIDIS:1;                 /**< bit:      1  QSPI Disable                                  */
    uint32_t :5;                        /**< bit:   2..6  Reserved                                      */
    uint32_t SWRST:1;                   /**< bit:      7  QSPI Software Reset                           */
    uint32_t :16;                       /**< bit:  8..23  Reserved                                      */
    uint32_t LASTXFER:1;                /**< bit:     24  Last Transfer                                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_CR_bits_t;

#define QSPI_CR_QSPIEN_Pos                    (0)                                            /**< (QSPI_CR) QSPI Enable Position */
#define QSPI_CR_QSPIEN_Msk                    (0x1U << QSPI_CR_QSPIEN_Pos)                   /**< (QSPI_CR) QSPI Enable Mask */
#define QSPI_CR_QSPIDIS_Pos                   (1)                                            /**< (QSPI_CR) QSPI Disable Position */
#define QSPI_CR_QSPIDIS_Msk                   (0x1U << QSPI_CR_QSPIDIS_Pos)                  /**< (QSPI_CR) QSPI Disable Mask */
#define QSPI_CR_SWRST_Pos                     (7)                                            /**< (QSPI_CR) QSPI Software Reset Position */
#define QSPI_CR_SWRST_Msk                     (0x1U << QSPI_CR_SWRST_Pos)                    /**< (QSPI_CR) QSPI Software Reset Mask */
#define QSPI_CR_LASTXFER_Pos                  (24)                                           /**< (QSPI_CR) Last Transfer Position */
#define QSPI_CR_LASTXFER_Msk                  (0x1U << QSPI_CR_LASTXFER_Pos)                 /**< (QSPI_CR) Last Transfer Mask */
#define QSPI_CR_Msk                           (0x01000083UL)                                 /**< (QSPI_CR) Register Mask  */

/* -------- QSPI_MR : (QSPI Offset: 0x04) (R/W 32) Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t SMM:1;                     /**< bit:      0  Serial Memory Mode                            */
    uint32_t LLB:1;                     /**< bit:      1  Local Loopback Enable                         */
    uint32_t WDRBT:1;                   /**< bit:      2  Wait Data Read Before Transfer                */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t CSMODE:2;                  /**< bit:   4..5  Chip Select Mode                              */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t NBBITS:4;                  /**< bit:  8..11  Number Of Bits Per Transfer                   */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t DLYBCT:8;                  /**< bit: 16..23  Delay Between Consecutive Transfers           */
    uint32_t DLYCS:8;                   /**< bit: 24..31  Minimum Inactive QCS Delay                    */
  };
  uint32_t w;
} __QSPI_MR_bits_t;

#define QSPI_MR_SMM_Pos                       (0)                                            /**< (QSPI_MR) Serial Memory Mode Position */
#define QSPI_MR_SMM_Msk                       (0x1U << QSPI_MR_SMM_Pos)                      /**< (QSPI_MR) Serial Memory Mode Mask */
#define   QSPI_MR_SMM_SPI_Val                 (0x0U)                                         /**< (QSPI_MR) The QSPI is in SPI mode.  */
#define   QSPI_MR_SMM_MEMORY_Val              (0x1U)                                         /**< (QSPI_MR) The QSPI is in Serial Memory mode.  */
#define QSPI_MR_SMM_SPI                       (QSPI_MR_SMM_SPI_Val << QSPI_MR_SMM_Pos)       /**< (QSPI_MR) The QSPI is in SPI mode. Position  */
#define QSPI_MR_SMM_MEMORY                    (QSPI_MR_SMM_MEMORY_Val << QSPI_MR_SMM_Pos)    /**< (QSPI_MR) The QSPI is in Serial Memory mode. Position  */
#define QSPI_MR_LLB_Pos                       (1)                                            /**< (QSPI_MR) Local Loopback Enable Position */
#define QSPI_MR_LLB_Msk                       (0x1U << QSPI_MR_LLB_Pos)                      /**< (QSPI_MR) Local Loopback Enable Mask */
#define   QSPI_MR_LLB_DISABLED_Val            (0x0U)                                         /**< (QSPI_MR) Local loopback path disabled.  */
#define   QSPI_MR_LLB_ENABLED_Val             (0x1U)                                         /**< (QSPI_MR) Local loopback path enabled.  */
#define QSPI_MR_LLB_DISABLED                  (QSPI_MR_LLB_DISABLED_Val << QSPI_MR_LLB_Pos)  /**< (QSPI_MR) Local loopback path disabled. Position  */
#define QSPI_MR_LLB_ENABLED                   (QSPI_MR_LLB_ENABLED_Val << QSPI_MR_LLB_Pos)   /**< (QSPI_MR) Local loopback path enabled. Position  */
#define QSPI_MR_WDRBT_Pos                     (2)                                            /**< (QSPI_MR) Wait Data Read Before Transfer Position */
#define QSPI_MR_WDRBT_Msk                     (0x1U << QSPI_MR_WDRBT_Pos)                    /**< (QSPI_MR) Wait Data Read Before Transfer Mask */
#define   QSPI_MR_WDRBT_DISABLED_Val          (0x0U)                                         /**< (QSPI_MR) No effect. In SPI mode, a transfer can be initiated whatever the state of the QSPI_RDR is.  */
#define   QSPI_MR_WDRBT_ENABLED_Val           (0x1U)                                         /**< (QSPI_MR) In SPI mode, a transfer can start only if the QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception.  */
#define QSPI_MR_WDRBT_DISABLED                (QSPI_MR_WDRBT_DISABLED_Val << QSPI_MR_WDRBT_Pos)  /**< (QSPI_MR) No effect. In SPI mode, a transfer can be initiated whatever the state of the QSPI_RDR is. Position  */
#define QSPI_MR_WDRBT_ENABLED                 (QSPI_MR_WDRBT_ENABLED_Val << QSPI_MR_WDRBT_Pos)  /**< (QSPI_MR) In SPI mode, a transfer can start only if the QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception. Position  */
#define QSPI_MR_CSMODE_Pos                    (4)                                            /**< (QSPI_MR) Chip Select Mode Position */
#define QSPI_MR_CSMODE_Msk                    (0x3U << QSPI_MR_CSMODE_Pos)                   /**< (QSPI_MR) Chip Select Mode Mask */
#define QSPI_MR_CSMODE(value)                 (QSPI_MR_CSMODE_Msk & ((value) << QSPI_MR_CSMODE_Pos))
#define   QSPI_MR_CSMODE_NOT_RELOADED_Val     (0x0U)                                         /**< (QSPI_MR) The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer.  */
#define   QSPI_MR_CSMODE_LASTXFER_Val         (0x1U)                                         /**< (QSPI_MR) The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in QSPI_TDR.TD has been transferred.  */
#define   QSPI_MR_CSMODE_SYSTEMATICALLY_Val   (0x2U)                                         /**< (QSPI_MR) The chip select is deasserted systematically after each transfer.  */
#define QSPI_MR_CSMODE_NOT_RELOADED           (QSPI_MR_CSMODE_NOT_RELOADED_Val << QSPI_MR_CSMODE_Pos)  /**< (QSPI_MR) The chip select is deasserted if QSPI_TDR.TD has not been reloaded before the end of the current transfer. Position  */
#define QSPI_MR_CSMODE_LASTXFER               (QSPI_MR_CSMODE_LASTXFER_Val << QSPI_MR_CSMODE_Pos)  /**< (QSPI_MR) The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in QSPI_TDR.TD has been transferred. Position  */
#define QSPI_MR_CSMODE_SYSTEMATICALLY         (QSPI_MR_CSMODE_SYSTEMATICALLY_Val << QSPI_MR_CSMODE_Pos)  /**< (QSPI_MR) The chip select is deasserted systematically after each transfer. Position  */
#define QSPI_MR_NBBITS_Pos                    (8)                                            /**< (QSPI_MR) Number Of Bits Per Transfer Position */
#define QSPI_MR_NBBITS_Msk                    (0xFU << QSPI_MR_NBBITS_Pos)                   /**< (QSPI_MR) Number Of Bits Per Transfer Mask */
#define QSPI_MR_NBBITS(value)                 (QSPI_MR_NBBITS_Msk & ((value) << QSPI_MR_NBBITS_Pos))
#define   QSPI_MR_NBBITS_8_BIT_Val            (0x0U)                                         /**< (QSPI_MR) 8 bits for transfer  */
#define   QSPI_MR_NBBITS_16_BIT_Val           (0x8U)                                         /**< (QSPI_MR) 16 bits for transfer  */
#define QSPI_MR_NBBITS_8_BIT                  (QSPI_MR_NBBITS_8_BIT_Val << QSPI_MR_NBBITS_Pos)  /**< (QSPI_MR) 8 bits for transfer Position  */
#define QSPI_MR_NBBITS_16_BIT                 (QSPI_MR_NBBITS_16_BIT_Val << QSPI_MR_NBBITS_Pos)  /**< (QSPI_MR) 16 bits for transfer Position  */
#define QSPI_MR_DLYBCT_Pos                    (16)                                           /**< (QSPI_MR) Delay Between Consecutive Transfers Position */
#define QSPI_MR_DLYBCT_Msk                    (0xFFU << QSPI_MR_DLYBCT_Pos)                  /**< (QSPI_MR) Delay Between Consecutive Transfers Mask */
#define QSPI_MR_DLYBCT(value)                 (QSPI_MR_DLYBCT_Msk & ((value) << QSPI_MR_DLYBCT_Pos))
#define QSPI_MR_DLYCS_Pos                     (24)                                           /**< (QSPI_MR) Minimum Inactive QCS Delay Position */
#define QSPI_MR_DLYCS_Msk                     (0xFFU << QSPI_MR_DLYCS_Pos)                   /**< (QSPI_MR) Minimum Inactive QCS Delay Mask */
#define QSPI_MR_DLYCS(value)                  (QSPI_MR_DLYCS_Msk & ((value) << QSPI_MR_DLYCS_Pos))
#define QSPI_MR_Msk                           (0xFFFF0F37UL)                                 /**< (QSPI_MR) Register Mask  */

/* -------- QSPI_RDR : (QSPI Offset: 0x08) (R/ 32) Receive Data Register -------- */

typedef union
{
  struct
  {
    uint32_t RD:16;                     /**< bit:  0..15  Receive Data                                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_RDR_bits_t;

#define QSPI_RDR_RD_Pos                       (0)                                            /**< (QSPI_RDR) Receive Data Position */
#define QSPI_RDR_RD_Msk                       (0xFFFFU << QSPI_RDR_RD_Pos)                   /**< (QSPI_RDR) Receive Data Mask */
#define QSPI_RDR_RD(value)                    (QSPI_RDR_RD_Msk & ((value) << QSPI_RDR_RD_Pos))
#define QSPI_RDR_Msk                          (0x0000FFFFUL)                                 /**< (QSPI_RDR) Register Mask  */

