zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/qspi.h
/* -------- QSPI_TDR : (QSPI Offset: 0x0c) (/W 32) Transmit Data Register -------- */

typedef union
{
  struct
  {
    uint32_t TD:16;                     /**< bit:  0..15  Transmit Data                                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_TDR_bits_t;

#define QSPI_TDR_TD_Pos                       (0)                                            /**< (QSPI_TDR) Transmit Data Position */
#define QSPI_TDR_TD_Msk                       (0xFFFFU << QSPI_TDR_TD_Pos)                   /**< (QSPI_TDR) Transmit Data Mask */
#define QSPI_TDR_TD(value)                    (QSPI_TDR_TD_Msk & ((value) << QSPI_TDR_TD_Pos))
#define QSPI_TDR_Msk                          (0x0000FFFFUL)                                 /**< (QSPI_TDR) Register Mask  */

/* -------- QSPI_SR : (QSPI Offset: 0x10) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t RDRF:1;                    /**< bit:      0  Receive Data Register Full (cleared by reading SPI_RDR) */
    uint32_t TDRE:1;                    /**< bit:      1  Transmit Data Register Empty (cleared by writing SPI_TDR) */
    uint32_t TXEMPTY:1;                 /**< bit:      2  Transmission Registers Empty (cleared by writing SPI_TDR) */
    uint32_t OVRES:1;                   /**< bit:      3  Overrun Error Status (cleared on read)        */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CSR:1;                     /**< bit:      8  Chip Select Rise (cleared on read)            */
    uint32_t CSS:1;                     /**< bit:      9  Chip Select Status                            */
    uint32_t INSTRE:1;                  /**< bit:     10  Instruction End Status (cleared on read)      */
    uint32_t :13;                       /**< bit: 11..23  Reserved                                      */
    uint32_t QSPIENS:1;                 /**< bit:     24  QSPI Enable Status                            */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_SR_bits_t;

#define QSPI_SR_RDRF_Pos                      (0)                                            /**< (QSPI_SR) Receive Data Register Full (cleared by reading SPI_RDR) Position */
#define QSPI_SR_RDRF_Msk                      (0x1U << QSPI_SR_RDRF_Pos)                     /**< (QSPI_SR) Receive Data Register Full (cleared by reading SPI_RDR) Mask */
#define QSPI_SR_TDRE_Pos                      (1)                                            /**< (QSPI_SR) Transmit Data Register Empty (cleared by writing SPI_TDR) Position */
#define QSPI_SR_TDRE_Msk                      (0x1U << QSPI_SR_TDRE_Pos)                     /**< (QSPI_SR) Transmit Data Register Empty (cleared by writing SPI_TDR) Mask */
#define QSPI_SR_TXEMPTY_Pos                   (2)                                            /**< (QSPI_SR) Transmission Registers Empty (cleared by writing SPI_TDR) Position */
#define QSPI_SR_TXEMPTY_Msk                   (0x1U << QSPI_SR_TXEMPTY_Pos)                  /**< (QSPI_SR) Transmission Registers Empty (cleared by writing SPI_TDR) Mask */
#define QSPI_SR_OVRES_Pos                     (3)                                            /**< (QSPI_SR) Overrun Error Status (cleared on read) Position */
#define QSPI_SR_OVRES_Msk                     (0x1U << QSPI_SR_OVRES_Pos)                    /**< (QSPI_SR) Overrun Error Status (cleared on read) Mask */
#define QSPI_SR_CSR_Pos                       (8)                                            /**< (QSPI_SR) Chip Select Rise (cleared on read) Position */
#define QSPI_SR_CSR_Msk                       (0x1U << QSPI_SR_CSR_Pos)                      /**< (QSPI_SR) Chip Select Rise (cleared on read) Mask */
#define QSPI_SR_CSS_Pos                       (9)                                            /**< (QSPI_SR) Chip Select Status Position */
#define QSPI_SR_CSS_Msk                       (0x1U << QSPI_SR_CSS_Pos)                      /**< (QSPI_SR) Chip Select Status Mask */
#define QSPI_SR_INSTRE_Pos                    (10)                                           /**< (QSPI_SR) Instruction End Status (cleared on read) Position */
#define QSPI_SR_INSTRE_Msk                    (0x1U << QSPI_SR_INSTRE_Pos)                   /**< (QSPI_SR) Instruction End Status (cleared on read) Mask */
#define QSPI_SR_QSPIENS_Pos                   (24)                                           /**< (QSPI_SR) QSPI Enable Status Position */
#define QSPI_SR_QSPIENS_Msk                   (0x1U << QSPI_SR_QSPIENS_Pos)                  /**< (QSPI_SR) QSPI Enable Status Mask */
#define QSPI_SR_Msk                           (0x0100070FUL)                                 /**< (QSPI_SR) Register Mask  */

/* -------- QSPI_IER : (QSPI Offset: 0x14) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t RDRF:1;                    /**< bit:      0  Receive Data Register Full Interrupt Enable   */
    uint32_t TDRE:1;                    /**< bit:      1  Transmit Data Register Empty Interrupt Enable */
    uint32_t TXEMPTY:1;                 /**< bit:      2  Transmission Registers Empty Enable           */
    uint32_t OVRES:1;                   /**< bit:      3  Overrun Error Interrupt Enable                */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CSR:1;                     /**< bit:      8  Chip Select Rise Interrupt Enable             */
    uint32_t CSS:1;                     /**< bit:      9  Chip Select Status Interrupt Enable           */
    uint32_t INSTRE:1;                  /**< bit:     10  Instruction End Interrupt Enable              */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_IER_bits_t;

