zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/qspi.h
#define QSPI_IER_RDRF_Pos                     (0)                                            /**< (QSPI_IER) Receive Data Register Full Interrupt Enable Position */
#define QSPI_IER_RDRF_Msk                     (0x1U << QSPI_IER_RDRF_Pos)                    /**< (QSPI_IER) Receive Data Register Full Interrupt Enable Mask */
#define QSPI_IER_TDRE_Pos                     (1)                                            /**< (QSPI_IER) Transmit Data Register Empty Interrupt Enable Position */
#define QSPI_IER_TDRE_Msk                     (0x1U << QSPI_IER_TDRE_Pos)                    /**< (QSPI_IER) Transmit Data Register Empty Interrupt Enable Mask */
#define QSPI_IER_TXEMPTY_Pos                  (2)                                            /**< (QSPI_IER) Transmission Registers Empty Enable Position */
#define QSPI_IER_TXEMPTY_Msk                  (0x1U << QSPI_IER_TXEMPTY_Pos)                 /**< (QSPI_IER) Transmission Registers Empty Enable Mask */
#define QSPI_IER_OVRES_Pos                    (3)                                            /**< (QSPI_IER) Overrun Error Interrupt Enable Position */
#define QSPI_IER_OVRES_Msk                    (0x1U << QSPI_IER_OVRES_Pos)                   /**< (QSPI_IER) Overrun Error Interrupt Enable Mask */
#define QSPI_IER_CSR_Pos                      (8)                                            /**< (QSPI_IER) Chip Select Rise Interrupt Enable Position */
#define QSPI_IER_CSR_Msk                      (0x1U << QSPI_IER_CSR_Pos)                     /**< (QSPI_IER) Chip Select Rise Interrupt Enable Mask */
#define QSPI_IER_CSS_Pos                      (9)                                            /**< (QSPI_IER) Chip Select Status Interrupt Enable Position */
#define QSPI_IER_CSS_Msk                      (0x1U << QSPI_IER_CSS_Pos)                     /**< (QSPI_IER) Chip Select Status Interrupt Enable Mask */
#define QSPI_IER_INSTRE_Pos                   (10)                                           /**< (QSPI_IER) Instruction End Interrupt Enable Position */
#define QSPI_IER_INSTRE_Msk                   (0x1U << QSPI_IER_INSTRE_Pos)                  /**< (QSPI_IER) Instruction End Interrupt Enable Mask */
#define QSPI_IER_Msk                          (0x0000070FUL)                                 /**< (QSPI_IER) Register Mask  */

/* -------- QSPI_IDR : (QSPI Offset: 0x18) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t RDRF:1;                    /**< bit:      0  Receive Data Register Full Interrupt Disable  */
    uint32_t TDRE:1;                    /**< bit:      1  Transmit Data Register Empty Interrupt Disable */
    uint32_t TXEMPTY:1;                 /**< bit:      2  Transmission Registers Empty Disable          */
    uint32_t OVRES:1;                   /**< bit:      3  Overrun Error Interrupt Disable               */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CSR:1;                     /**< bit:      8  Chip Select Rise Interrupt Disable            */
    uint32_t CSS:1;                     /**< bit:      9  Chip Select Status Interrupt Disable          */
    uint32_t INSTRE:1;                  /**< bit:     10  Instruction End Interrupt Disable             */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_IDR_bits_t;

#define QSPI_IDR_RDRF_Pos                     (0)                                            /**< (QSPI_IDR) Receive Data Register Full Interrupt Disable Position */
#define QSPI_IDR_RDRF_Msk                     (0x1U << QSPI_IDR_RDRF_Pos)                    /**< (QSPI_IDR) Receive Data Register Full Interrupt Disable Mask */
#define QSPI_IDR_TDRE_Pos                     (1)                                            /**< (QSPI_IDR) Transmit Data Register Empty Interrupt Disable Position */
#define QSPI_IDR_TDRE_Msk                     (0x1U << QSPI_IDR_TDRE_Pos)                    /**< (QSPI_IDR) Transmit Data Register Empty Interrupt Disable Mask */
#define QSPI_IDR_TXEMPTY_Pos                  (2)                                            /**< (QSPI_IDR) Transmission Registers Empty Disable Position */
#define QSPI_IDR_TXEMPTY_Msk                  (0x1U << QSPI_IDR_TXEMPTY_Pos)                 /**< (QSPI_IDR) Transmission Registers Empty Disable Mask */
#define QSPI_IDR_OVRES_Pos                    (3)                                            /**< (QSPI_IDR) Overrun Error Interrupt Disable Position */
#define QSPI_IDR_OVRES_Msk                    (0x1U << QSPI_IDR_OVRES_Pos)                   /**< (QSPI_IDR) Overrun Error Interrupt Disable Mask */
#define QSPI_IDR_CSR_Pos                      (8)                                            /**< (QSPI_IDR) Chip Select Rise Interrupt Disable Position */
#define QSPI_IDR_CSR_Msk                      (0x1U << QSPI_IDR_CSR_Pos)                     /**< (QSPI_IDR) Chip Select Rise Interrupt Disable Mask */
#define QSPI_IDR_CSS_Pos                      (9)                                            /**< (QSPI_IDR) Chip Select Status Interrupt Disable Position */
#define QSPI_IDR_CSS_Msk                      (0x1U << QSPI_IDR_CSS_Pos)                     /**< (QSPI_IDR) Chip Select Status Interrupt Disable Mask */
#define QSPI_IDR_INSTRE_Pos                   (10)                                           /**< (QSPI_IDR) Instruction End Interrupt Disable Position */
#define QSPI_IDR_INSTRE_Msk                   (0x1U << QSPI_IDR_INSTRE_Pos)                  /**< (QSPI_IDR) Instruction End Interrupt Disable Mask */
#define QSPI_IDR_Msk                          (0x0000070FUL)                                 /**< (QSPI_IDR) Register Mask  */

/* -------- QSPI_IMR : (QSPI Offset: 0x1c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t RDRF:1;                    /**< bit:      0  Receive Data Register Full Interrupt Mask     */
    uint32_t TDRE:1;                    /**< bit:      1  Transmit Data Register Empty Interrupt Mask   */
    uint32_t TXEMPTY:1;                 /**< bit:      2  Transmission Registers Empty Mask             */
    uint32_t OVRES:1;                   /**< bit:      3  Overrun Error Interrupt Mask                  */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CSR:1;                     /**< bit:      8  Chip Select Rise Interrupt Mask               */
    uint32_t CSS:1;                     /**< bit:      9  Chip Select Status Interrupt Mask             */
    uint32_t INSTRE:1;                  /**< bit:     10  Instruction End Interrupt Mask                */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_IMR_bits_t;

