zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/qspi.h
#define QSPI_IMR_RDRF_Pos                     (0)                                            /**< (QSPI_IMR) Receive Data Register Full Interrupt Mask Position */
#define QSPI_IMR_RDRF_Msk                     (0x1U << QSPI_IMR_RDRF_Pos)                    /**< (QSPI_IMR) Receive Data Register Full Interrupt Mask Mask */
#define QSPI_IMR_TDRE_Pos                     (1)                                            /**< (QSPI_IMR) Transmit Data Register Empty Interrupt Mask Position */
#define QSPI_IMR_TDRE_Msk                     (0x1U << QSPI_IMR_TDRE_Pos)                    /**< (QSPI_IMR) Transmit Data Register Empty Interrupt Mask Mask */
#define QSPI_IMR_TXEMPTY_Pos                  (2)                                            /**< (QSPI_IMR) Transmission Registers Empty Mask Position */
#define QSPI_IMR_TXEMPTY_Msk                  (0x1U << QSPI_IMR_TXEMPTY_Pos)                 /**< (QSPI_IMR) Transmission Registers Empty Mask Mask */
#define QSPI_IMR_OVRES_Pos                    (3)                                            /**< (QSPI_IMR) Overrun Error Interrupt Mask Position */
#define QSPI_IMR_OVRES_Msk                    (0x1U << QSPI_IMR_OVRES_Pos)                   /**< (QSPI_IMR) Overrun Error Interrupt Mask Mask */
#define QSPI_IMR_CSR_Pos                      (8)                                            /**< (QSPI_IMR) Chip Select Rise Interrupt Mask Position */
#define QSPI_IMR_CSR_Msk                      (0x1U << QSPI_IMR_CSR_Pos)                     /**< (QSPI_IMR) Chip Select Rise Interrupt Mask Mask */
#define QSPI_IMR_CSS_Pos                      (9)                                            /**< (QSPI_IMR) Chip Select Status Interrupt Mask Position */
#define QSPI_IMR_CSS_Msk                      (0x1U << QSPI_IMR_CSS_Pos)                     /**< (QSPI_IMR) Chip Select Status Interrupt Mask Mask */
#define QSPI_IMR_INSTRE_Pos                   (10)                                           /**< (QSPI_IMR) Instruction End Interrupt Mask Position */
#define QSPI_IMR_INSTRE_Msk                   (0x1U << QSPI_IMR_INSTRE_Pos)                  /**< (QSPI_IMR) Instruction End Interrupt Mask Mask */
#define QSPI_IMR_Msk                          (0x0000070FUL)                                 /**< (QSPI_IMR) Register Mask  */

/* -------- QSPI_SCR : (QSPI Offset: 0x20) (R/W 32) Serial Clock Register -------- */

typedef union
{
  struct
  {
    uint32_t CPOL:1;                    /**< bit:      0  Clock Polarity                                */
    uint32_t CPHA:1;                    /**< bit:      1  Clock Phase                                   */
    uint32_t :6;                        /**< bit:   2..7  Reserved                                      */
    uint32_t SCBR:8;                    /**< bit:  8..15  Serial Clock Baud Rate                        */
    uint32_t DLYBS:8;                   /**< bit: 16..23  Delay Before QSCK                             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_SCR_bits_t;

#define QSPI_SCR_CPOL_Pos                     (0)                                            /**< (QSPI_SCR) Clock Polarity Position */
#define QSPI_SCR_CPOL_Msk                     (0x1U << QSPI_SCR_CPOL_Pos)                    /**< (QSPI_SCR) Clock Polarity Mask */
#define QSPI_SCR_CPHA_Pos                     (1)                                            /**< (QSPI_SCR) Clock Phase Position */
#define QSPI_SCR_CPHA_Msk                     (0x1U << QSPI_SCR_CPHA_Pos)                    /**< (QSPI_SCR) Clock Phase Mask */
#define QSPI_SCR_SCBR_Pos                     (8)                                            /**< (QSPI_SCR) Serial Clock Baud Rate Position */
#define QSPI_SCR_SCBR_Msk                     (0xFFU << QSPI_SCR_SCBR_Pos)                   /**< (QSPI_SCR) Serial Clock Baud Rate Mask */
#define QSPI_SCR_SCBR(value)                  (QSPI_SCR_SCBR_Msk & ((value) << QSPI_SCR_SCBR_Pos))
#define QSPI_SCR_DLYBS_Pos                    (16)                                           /**< (QSPI_SCR) Delay Before QSCK Position */
#define QSPI_SCR_DLYBS_Msk                    (0xFFU << QSPI_SCR_DLYBS_Pos)                  /**< (QSPI_SCR) Delay Before QSCK Mask */
#define QSPI_SCR_DLYBS(value)                 (QSPI_SCR_DLYBS_Msk & ((value) << QSPI_SCR_DLYBS_Pos))
#define QSPI_SCR_Msk                          (0x00FFFF03UL)                                 /**< (QSPI_SCR) Register Mask  */

/* -------- QSPI_IAR : (QSPI Offset: 0x30) (R/W 32) Instruction Address Register -------- */

typedef union
{
  struct
  {
    uint32_t ADDR:32;                   /**< bit:  0..31  Address                                       */
  };
  uint32_t w;
} __QSPI_IAR_bits_t;

#define QSPI_IAR_ADDR_Pos                     (0)                                            /**< (QSPI_IAR) Address Position */
#define QSPI_IAR_ADDR_Msk                     (0xFFFFFFFFU << QSPI_IAR_ADDR_Pos)             /**< (QSPI_IAR) Address Mask */
#define QSPI_IAR_ADDR(value)                  (QSPI_IAR_ADDR_Msk & ((value) << QSPI_IAR_ADDR_Pos))
#define QSPI_IAR_Msk                          (0xFFFFFFFFUL)                                 /**< (QSPI_IAR) Register Mask  */

/* -------- QSPI_ICR : (QSPI Offset: 0x34) (R/W 32) Instruction Code Register -------- */

typedef union
{
  struct
  {
    uint32_t INST:8;                    /**< bit:   0..7  Instruction Code                              */
    uint32_t :8;                        /**< bit:  8..15  Reserved                                      */
    uint32_t OPT:8;                     /**< bit: 16..23  Option Code                                   */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_ICR_bits_t;

#define QSPI_ICR_INST_Pos                     (0)                                            /**< (QSPI_ICR) Instruction Code Position */
#define QSPI_ICR_INST_Msk                     (0xFFU << QSPI_ICR_INST_Pos)                   /**< (QSPI_ICR) Instruction Code Mask */
#define QSPI_ICR_INST(value)                  (QSPI_ICR_INST_Msk & ((value) << QSPI_ICR_INST_Pos))
#define QSPI_ICR_OPT_Pos                      (16)                                           /**< (QSPI_ICR) Option Code Position */
#define QSPI_ICR_OPT_Msk                      (0xFFU << QSPI_ICR_OPT_Pos)                    /**< (QSPI_ICR) Option Code Mask */
#define QSPI_ICR_OPT(value)                   (QSPI_ICR_OPT_Msk & ((value) << QSPI_ICR_OPT_Pos))
#define QSPI_ICR_Msk                          (0x00FF00FFUL)                                 /**< (QSPI_ICR) Register Mask  */

