zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/qspi.h
#define QSPI_SMR_SCREN_Pos                    (0)                                            /**< (QSPI_SMR) Scrambling/Unscrambling Enable Position */
#define QSPI_SMR_SCREN_Msk                    (0x1U << QSPI_SMR_SCREN_Pos)                   /**< (QSPI_SMR) Scrambling/Unscrambling Enable Mask */
#define   QSPI_SMR_SCREN_DISABLED_Val         (0x0U)                                         /**< (QSPI_SMR) The scrambling/unscrambling is disabled.  */
#define   QSPI_SMR_SCREN_ENABLED_Val          (0x1U)                                         /**< (QSPI_SMR) The scrambling/unscrambling is enabled.  */
#define QSPI_SMR_SCREN_DISABLED               (QSPI_SMR_SCREN_DISABLED_Val << QSPI_SMR_SCREN_Pos)  /**< (QSPI_SMR) The scrambling/unscrambling is disabled. Position  */
#define QSPI_SMR_SCREN_ENABLED                (QSPI_SMR_SCREN_ENABLED_Val << QSPI_SMR_SCREN_Pos)  /**< (QSPI_SMR) The scrambling/unscrambling is enabled. Position  */
#define QSPI_SMR_RVDIS_Pos                    (1)                                            /**< (QSPI_SMR) Scrambling/Unscrambling Random Value Disable Position */
#define QSPI_SMR_RVDIS_Msk                    (0x1U << QSPI_SMR_RVDIS_Pos)                   /**< (QSPI_SMR) Scrambling/Unscrambling Random Value Disable Mask */
#define QSPI_SMR_Msk                          (0x00000003UL)                                 /**< (QSPI_SMR) Register Mask  */

/* -------- QSPI_SKR : (QSPI Offset: 0x44) (/W 32) Scrambling Key Register -------- */

typedef union
{
  struct
  {
    uint32_t USRK:32;                   /**< bit:  0..31  User Scrambling Key                           */
  };
  uint32_t w;
} __QSPI_SKR_bits_t;

#define QSPI_SKR_USRK_Pos                     (0)                                            /**< (QSPI_SKR) User Scrambling Key Position */
#define QSPI_SKR_USRK_Msk                     (0xFFFFFFFFU << QSPI_SKR_USRK_Pos)             /**< (QSPI_SKR) User Scrambling Key Mask */
#define QSPI_SKR_USRK(value)                  (QSPI_SKR_USRK_Msk & ((value) << QSPI_SKR_USRK_Pos))
#define QSPI_SKR_Msk                          (0xFFFFFFFFUL)                                 /**< (QSPI_SKR) Register Mask  */

/* -------- QSPI_WPMR : (QSPI Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __QSPI_WPMR_bits_t;

#define QSPI_WPMR_WPEN_Pos                    (0)                                            /**< (QSPI_WPMR) Write Protection Enable Position */
#define QSPI_WPMR_WPEN_Msk                    (0x1U << QSPI_WPMR_WPEN_Pos)                   /**< (QSPI_WPMR) Write Protection Enable Mask */
#define QSPI_WPMR_WPKEY_Pos                   (8)                                            /**< (QSPI_WPMR) Write Protection Key Position */
#define QSPI_WPMR_WPKEY_Msk                   (0xFFFFFFU << QSPI_WPMR_WPKEY_Pos)             /**< (QSPI_WPMR) Write Protection Key Mask */
#define QSPI_WPMR_WPKEY(value)                (QSPI_WPMR_WPKEY_Msk & ((value) << QSPI_WPMR_WPKEY_Pos))
#define   QSPI_WPMR_WPKEY_PASSWD_Val          (0x515350U)                                    /**< (QSPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define QSPI_WPMR_WPKEY_PASSWD                (QSPI_WPMR_WPKEY_PASSWD_Val << QSPI_WPMR_WPKEY_Pos)  /**< (QSPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define QSPI_WPMR_Msk                         (0xFFFFFF01UL)                                 /**< (QSPI_WPMR) Register Mask  */

/* -------- QSPI_WPSR : (QSPI Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:8;                  /**< bit:  8..15  Write Protection Violation Source             */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __QSPI_WPSR_bits_t;

#define QSPI_WPSR_WPVS_Pos                    (0)                                            /**< (QSPI_WPSR) Write Protection Violation Status Position */
#define QSPI_WPSR_WPVS_Msk                    (0x1U << QSPI_WPSR_WPVS_Pos)                   /**< (QSPI_WPSR) Write Protection Violation Status Mask */
#define QSPI_WPSR_WPVSRC_Pos                  (8)                                            /**< (QSPI_WPSR) Write Protection Violation Source Position */
#define QSPI_WPSR_WPVSRC_Msk                  (0xFFU << QSPI_WPSR_WPVSRC_Pos)                /**< (QSPI_WPSR) Write Protection Violation Source Mask */
#define QSPI_WPSR_WPVSRC(value)               (QSPI_WPSR_WPVSRC_Msk & ((value) << QSPI_WPSR_WPVSRC_Pos))
#define QSPI_WPSR_Msk                         (0x0000FF01UL)                                 /**< (QSPI_WPSR) Register Mask  */

/** \brief QSPI register offsets definitions */
#define QSPI_CR_OFFSET               (0x00)         /**< (QSPI_CR) Control Register Offset */
#define QSPI_MR_OFFSET               (0x04)         /**< (QSPI_MR) Mode Register Offset */
#define QSPI_RDR_OFFSET              (0x08)         /**< (QSPI_RDR) Receive Data Register Offset */
#define QSPI_TDR_OFFSET              (0x0C)         /**< (QSPI_TDR) Transmit Data Register Offset */
#define QSPI_SR_OFFSET               (0x10)         /**< (QSPI_SR) Status Register Offset */
#define QSPI_IER_OFFSET              (0x14)         /**< (QSPI_IER) Interrupt Enable Register Offset */
#define QSPI_IDR_OFFSET              (0x18)         /**< (QSPI_IDR) Interrupt Disable Register Offset */
#define QSPI_IMR_OFFSET              (0x1C)         /**< (QSPI_IMR) Interrupt Mask Register Offset */
#define QSPI_SCR_OFFSET              (0x20)         /**< (QSPI_SCR) Serial Clock Register Offset */
#define QSPI_IAR_OFFSET              (0x30)         /**< (QSPI_IAR) Instruction Address Register Offset */
#define QSPI_ICR_OFFSET              (0x34)         /**< (QSPI_ICR) Instruction Code Register Offset */
#define QSPI_IFR_OFFSET              (0x38)         /**< (QSPI_IFR) Instruction Frame Register Offset */
#define QSPI_SMR_OFFSET              (0x40)         /**< (QSPI_SMR) Scrambling Mode Register Offset */
#define QSPI_SKR_OFFSET              (0x44)         /**< (QSPI_SKR) Scrambling Key Register Offset */
#define QSPI_WPMR_OFFSET             (0xE4)         /**< (QSPI_WPMR) Write Protection Mode Register Offset */
#define QSPI_WPSR_OFFSET             (0xE8)         /**< (QSPI_WPSR) Write Protection Status Register Offset */

/** \brief QSPI register API structure */
typedef struct
{
  __O   __QSPI_CR_bits_t               QSPI_CR;       /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __QSPI_MR_bits_t               QSPI_MR;       /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   __QSPI_RDR_bits_t              QSPI_RDR;      /**< Offset: 0x08 (R/   32) Receive Data Register */
  __O   __QSPI_TDR_bits_t              QSPI_TDR;      /**< Offset: 0x0C ( /W  32) Transmit Data Register */
  __I   __QSPI_SR_bits_t               QSPI_SR;       /**< Offset: 0x10 (R/   32) Status Register */
  __O   __QSPI_IER_bits_t              QSPI_IER;      /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   __QSPI_IDR_bits_t              QSPI_IDR;      /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   __QSPI_IMR_bits_t              QSPI_IMR;      /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __IO  __QSPI_SCR_bits_t              QSPI_SCR;      /**< Offset: 0x20 (R/W  32) Serial Clock Register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  __QSPI_IAR_bits_t              QSPI_IAR;      /**< Offset: 0x30 (R/W  32) Instruction Address Register */
  __IO  __QSPI_ICR_bits_t              QSPI_ICR;      /**< Offset: 0x34 (R/W  32) Instruction Code Register */
  __IO  __QSPI_IFR_bits_t              QSPI_IFR;      /**< Offset: 0x38 (R/W  32) Instruction Frame Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  __QSPI_SMR_bits_t              QSPI_SMR;      /**< Offset: 0x40 (R/W  32) Scrambling Mode Register */
  __O   __QSPI_SKR_bits_t              QSPI_SKR;      /**< Offset: 0x44 ( /W  32) Scrambling Key Register */
  __I   uint8_t                        Reserved3[0x9C];
  __IO  __QSPI_WPMR_bits_t             QSPI_WPMR;     /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __QSPI_WPSR_bits_t             QSPI_WPSR;     /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} qspi_registers_t;
/** @}  end of Quad Serial Peripheral Interface */

#endif /* _PIC32CZ_CA70_QSPI_COMPONENT_H_ */
